#+TITLE: Shell Script Resilience
#+SUBTITLE:  PostgreSQL Installation
#+AUTHOR: J. Greg Davidson
#+DATE: 18 October 2022
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
# +OPTIONS: date:nil
# +OPTIONS: author:nil

*** Getting The Source Files

The first point of failure is the omission of how we might obtain source files
for a desired source files for the desired version of PostgreSQL.  Fortunately,
they are easily downloaded from [[https://www.postgresql.org/ftp/source/][PostgreSQL Sources]]

#+begin_src sh
  #!/usr/bin/bash -eu
  # We're using the bash shell with options
  # -e -- stop if any command fails
  # -u -- unknown variable references treated as errors
  cd ~/Downloads # where we can initially save the files
  # the downloads directory for the desired version
  url_base='https://ftp.postgresql.org/pub/source/v15.0'
  file_base='postgresql-15.0.tar' # the tar archive
  bz2="$file_base.bz2" # the bz2 compressed archive
  md5="$bz2.md5" # the md5 checksum for the bz2 file
  sha256="$bz2.sha256" # the sha256 checksum for the bz2 file
  # download all three files
  wget --quiet "$url_base/$bz2" "$url_base/$md5" "$url_base/$sha256"
  # Verify the compressed archive with the md5 checksum
  md5sum -c "$md5"
  # Verify the compressed archive with the sha256 checksum
  sha256sum -c "$sha256"
#+end_src

#+RESULTS:
| postgresql-15.0.tar.bz2: | OK |
| postgresql-15.0.tar.bz2: | OK |

Note that there are other ways we could get the PostgreSQL sources, including
cloning a Git Repository.

